Cirbug/liuPNP/sdkconfig.defaults
# ESP32-P4 MIPI CSI Camera + WiFi
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESP32P4_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_WIFI_STA=y
CONFIG_ESP_WIFI_SSID="YOUR_WIFI_SSID"
CONFIG_ESP_WIFI_PASSWORD="YOUR_WIFI_PASSWORD"
CONFIG_ESP_MAXIMUM_RETRY=5
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5640=y
# FATFS for TF卡
CONFIG_FATFS_LFN_HEAP=y
